/** @file

;******************************************************************************
;* Copyright (c) 2014, Insyde Software Corp. All Rights Reserved.
;*
;* You may not reproduce, distribute, publish, display, perform, modify, adapt,
;* transmit, broadcast, present, recite, release, license or otherwise exploit
;* any part of this publication in any form, by any means, without the prior
;* written permission of Insyde Software Corporation.
;*
;******************************************************************************
*/

/=#

#string STR_FTPM_SUPPORT_STRING                        #language en-US        "FTPM Support"
                                                       #language fr-FR        "FTPM Support"
                                                       #language zh-TW        "FTPM Support"
                                                       #language it-IT        "FTPM Support"
                                                       #language es-ES        "FTPM Support"
                                                       #language de-DE        "FTPM Support"
                                                       #language pt-PT        "FTPM Support"
#string STR_FTPM_SUPPORT_HELP                          #language en-US        "FTPM Support Enable / Disable"
                                                       #language fr-FR        "FTPM Support Enable / Disable"
                                                       #language zh-TW        "FTPM Support Enable / Disable"
                                                       #language it-IT        "FTPM Support Enable / Disable"
                                                       #language es-ES        "FTPM Support Enable / Disable"
                                                       #language de-DE        "FTPM Support Enable / Disable"
                                                       #language pt-PT        "FTPM Support Enable / Disable"
#string STR_MEASURED_BOOT_ENABLE_PROMPT                #language en-US "Measured Boot"
#string STR_MEASURED_BOOT_ENABLE_HELP                  #language en-US "Enable/Disable Measured Boot"

#string STR_SECURITY_CONFIGURATION_TITLE               #language en-US "Security Configuration"
#string STR_SECURITY_CONFIGURATION_HELP                #language en-US ""
#string STR_SEC_CONFIGURATION_SUBTITLE                 #language en-US "TXE Configuration"
#string STR_TXE_FW_STRING                               #language en-US "TXE FW"
#string STR_TXE_FW_VALUE                                #language en-US "N/A"
#string STR_SEC_CAPABILITY_STRING                      #language en-US "TXE FW Capabilities"
#string STR_SEC_CAPABILITY_VALUE                       #language en-US ""
#string STR_SEC_FEATURE_STRING                         #language en-US "TXE FW Features"
#string STR_SEC_FEATURE_VALUE                          #language en-US ""
#string STR_SEC_OEMTAG_STRING                          #language en-US "TXE FW OEM Tag"
#string STR_SEC_OEMTAG_VALUE                           #language en-US ""
#string STR_SEC_TEMP_DISABLE_HELP                      #language en-US "TXE Temporary Disable"
#string STR_SEC_TEMP_DISABLE_STRING                    #language en-US "TXE Firmware Mode"
#string STR_SEC_TEMP_DISABLE_PROMPT                    #language en-US "TXE Temporary Disable"
#string STR_SEC_SETTING_PROMPT                         #language en-US "TXE"
#string STR_SEC_SETTING_HELP                           #language en-US ""
#string STR_SEC_FLASH_UPDATE_PROMPT                    #language en-US "TXE HMRFPO "
#string STR_SEC_FLASH_UPDATE_HELP                      #language en-US ""
#string STR_SEC_FIRMWARE_UPDATE_PROMPT                 #language en-US "TXE Firmware Update"
#string STR_SEC_FIRMWARE_UPDATE_HELP                   #language en-US ""
#string STR_SEC_EOP_HELP                               #language en-US "Send EOP Message Befor Enter OS"
#string STR_SEC_EOP_PROMPT                             #language en-US "TXE EOP Message"
#string STR_SEC_UNCONFIGURATION_PROMPT                 #language en-US "TXE Unconfiguration Perform"
#string STR_SEC_UNCONFIGURATION_HELP                   #language en-US ""
#string STR_PTT_SUBTITLE                               #language en-US "Platform Trust Technology"
#string STR_PTT_PROMPT                                 #language en-US "PTT "
#string STR_PTT_HELP                                   #language en-US "Enable/Disable PTT, \n\nIn AUTO mode, PTT will only be enabled when WOS is selected."
#string STR_TPM_CONFIGURATION_PROMPT                   #language en-US "TPM Configuration"
#string STR_TPM_PROMPT                                 #language en-US "Discrete TPM"
#string STR_TPM_HELP                                   #language en-US ""
#string STR_TDT_CONFIG_HELP                            #language en-US "Enable/Disable BIOS AT Code(TDTAM) from Running - for testing only."
#string STR_TDT_RECOVERY_PROMPT                        #language en-US "AT Recovery"
#string STR_TDT_RECOVERY_HELP                          #language en-US "Set the number of times AT Recovery attempts will be allowed"
#string STR_TDT_SUSPEND_PROMPT                         #language en-US "Enter AT Suspend Mode"
#string STR_TDT_SUSPEND_HELP                           #language en-US "Request that platform enter AT Suspend Mode - Only Available when AT Enrolled"
